content-org/idealized-versions-of-moessners-theorem-and-longs-theorem.org
#+hugo_base_dir: ../
#+hugo_section: ./categories/moessner's-sieve/
#+hugo_front_matter_key_replace: description>summary
#+hugo_categories: "Moessner's Sieve"
#+hugo_tags: "Haskell" "Mathematics" "Moessner's Process" "Moessner's Theorem" "Long's Theorem"

#+title: Idealized versions of Moessner's theorem&#x000a;and Long's theorem
#+date: 2016-07-10T00:00:00Z
#+description: In this post, we present idealized versions of Moessner's theorem and Long's theorem.

#+begin_blockquote
/"One chord is fine./\\
/Two chords are pushing it./\\
/Three chords and you're into jazz."/\\
-- *Lou Reed*
#+end_blockquote

** 1. Introduction
This is a follow-up post to [[/categories/moessners-sieve/a-grid-of-moessner-triangles][A grid of Moessner triangles]]. The goal of this blog
post is to state Moessner's idealized theorem, Long's idealized theorem, and
conjecture a further generalization.

The chapter is structured as follows. In Section [[*2. Moessner's idealized theorem][2]] we start by adapting
Moessner's theorem to the dual sieve in order to obtain Moessner's idealized
theorem. Then, in Section [[*3. Long's idealized theorem][3]], we repeat the process for Long's theorem, which
motivates the statement of Long's idealized theorem along with Long's weak
theorem. Finally, we conjecture a further generalization of Long's idealized
theorem in Section [[*4. Beyond Long's idealized theorem][4]]. The post is concluded in Section [[*5. Conclusion][5]].

** 2. Moessner's idealized theorem
In order to obtain Moessner's idealized theorem, we start from Moessner's
original theorem, generalize it and adapt it to the dual sieve.

*Theorem 1* (Moessner's theorem). /Given an initial sequence of positive natural
numbers,/

\begin{equation*}
  1, 2, 3, \dots,
\end{equation*}

/and a natural number $k \ge 2$, we obtain the result sequence of successive
powers,/

\begin{equation*}
  1^k, 2^k, 3^k, \dots,
\end{equation*}

/when performing the following procedure:/

1. /Drop every \(k\)th element of the inital sequence,/
2. /partially sum the remaining elements into a new sequence, and/
3. /decrease $k$ by $1$./

/The above procedure is repeated if $k>1$ and stops if $k=1$. We call the
procedure above Moessner’s sieve and call $k$ the rank of the sieve./

As we saw in [[/categories/moessners-sieve/an-introduction-to-moessner-s-theorem-and-moessners-sieve][the first post on Moessner's theorem]] we can generalize the initial
sequence and still obtain the same result sequence,

*Theorem 2* (Moessner's generalized theorem). /Given the initial sequence of $1$
followed by \(0\)s,/

\begin{equation*}
    1, 0, 0, \dots,
\end{equation*}

/and a natural number $k + 2$, we obtain the result sequence of successive
powers,/

\begin{equation*}
  1^k, 2^k, 3^k, \dots,
\end{equation*}

/when applying Moessner's sieve on the initial sequence./

So, if we let the rank $k = 4$, an example application of Theorem 2 becomes,

\begin{equation*}
  \begin{array}{*{19}{r}}
    1 & 0 & 0 & 0 & 0 & \textbf{0} & 0 & 0 & 0 & 0 & 0 & \textbf{0} & 0 & 0 & 0
    & 0 & 0 & \textbf{0} & \dots \\
    1 & 1 & 1 & 1 & \textbf{1} & & 1 & 1 & 1 & 1 & \textbf{1} & & 1 & 1 & 1 & 1
    & \textbf{1} & & \dots \\
    1 & 2 & 3 & \textbf{4} & & & 5 & 6 & 7 & \textbf{8} & & & 9 & 10 & 11 &
    \textbf{12} & & & \dots \\
    %
    1 & 3 & \textbf{6} & & & & 11 & 17 & \textbf{24} & & & & 33 & 43 &
    \textbf{54} & & & & \dots \\
    %
    1 & \textbf{4} & & & & & 15 & \textbf{32} & & & & & 65 & \textbf{108} & & &
    & & \dots \\
    %
    1 & & & & & & 16 & & & & & & 81 & & & & & & \dots
  \end{array}
\end{equation*}

where we still obtain a result sequence of values to the fourth power. If we
compare the above example to where we left off in the [[/categories/moessners-sieve/a-dual-to-moessners-sieve][post on the dual of
Moessner's sieve]],

\begin{equation*}
  \begin{array}{*{8}{r}}
     & & 0 & 0 & 0 & 0 & 0 & 0 \\\\
   1 & & 1 & 1 & 1 & 1 & 1 &   \\
   0 & & 1 & 2 & 3 & 4 &   &   \\
   0 & & 1 & 3 & 6 &   &   &   \\
   0 & & 1 & 4 &   &   &   &   \\
   0 & & 1 &   &   &   &   &   \\
   0 & &   &   &   &   &   &
  \end{array}
  \begin{array}{*{8}{r}}
      & &  0 &  0 &  0 & 0 & 0 & 0 \\\\
    1 & &  1 &  1 &  1 & 1 & 1 &   \\
    4 & &  5 &  6 &  7 & 8 &   &   \\
    6 & & 11 & 17 & 24 &   &   &   \\
    4 & & 15 & 32 &    &   &   &   \\
    1 & & 16 &    &    &   &   &   \\
    0 & &    &    &    &   &   &
  \end{array}
  \begin{array}{*{8}{r}}
      & &  0 &   0 &  0 &  0 & 0 & 0 \\\\
    1 & &  1 &   1 &  1 &  1 & 1 &   \\
    8 & &  9 &  10 & 11 & 12 &   &   \\
   24 & & 33 &  43 & 54 &    &   &   \\
   32 & & 65 & 108 &    &    &   &   \\
   16 & & 81 &     &    &    &   &   \\
    0 & &    &     &    &    &   &
  \end{array}
\end{equation*}

where we introduced the concept of an initial configuration of a sieve along
with the concept of seed tuples, we notice that instead of an initial sequence
of $1$ followed by \(0\)s, we have an initial configuration of two seed tuples,
where the horizontal seed tuple is filled with \(0\)s and the vertical seed
tuple is filled with a $1$ followed by \(0\)s. Likewise, instead of a result
sequence of values to the forth power, we obtain a sequence of Moessner
triangles, whose bottom-most elements enumerate the same result sequence of
values to the forth power. If we apply these differences to the statement of
Theorem 2, we obtain Moessner's idealized theorem,

*Theorem 3* (Moessner's idealized theorem). /Given an initial configuration of
two seed tuples with length $k + 2$,/

\begin{equation*}
  (0,0,0,\dots,0) \textit{ and } (1,0,0,\dots,0),
\end{equation*}

/we obtain the sequence of Moessner triangles of rank $k$, where the bottom-most
elements enumerate the sequence,/

\begin{equation*}
  1^k, 2^k, 3^k, \dots.
\end{equation*}

Having gone from Moessner's original theorem to Moessner's idealized theorem,
which reflects the structure of the dual sieve, we proceed to apply similar
transformations to Long's theorem.

