content/posts/idealized-versions-of-moessners-theorem-and-longs-theorem.md


## 3. Long's idealized theorem {#3-dot-long-s-idealized-theorem}

In order to state Long's idealized theorem, we follow the same process as
established in the previous section, and repeat the traditional definition of
Long's theorem and afterwards adapt it to the dual sieve.

**Theorem 4** (Long's theorem). _Given an initial sequence, which can be
described as an arithmetic progression,_

\begin{equation\*}
  c, c + d, c + 2d, c + 3d, \dots,
\end{equation\*}

_we obtain the result sequence,_

\begin{equation\*}
  c \cdot 1^{k - 1}, (c + d) \cdot 2^{k - 1}, (c + 2d) \cdot 3^{k - 1}, \dots,
\end{equation\*}

_when applying Moessner's sieve of rank \\(k\\) on the initial sequence._

We can visualize Long's theorem as the sieve,

\begin{equation\*}
  \begin{array}{\*{11}{r}}
  c &  c+d &  c+2d & c+3d & &  c+4d &    c+5d &   c+6d & c+7d & & \dots \\\\
  c & 2c+d & 3c+3d &      & & 4c+7d &  5c+12d & 6c+18d &      & & \dots \\\\
  c & 3c+d &       &      & & 7c+8d & 12c+20d &        &      & & \dots \\\\
  c &      &       &      & & 8c+8d &         &        &      & & \dots
  \end{array}
\end{equation\*}

for which Long[^fn:1] also noted that we can generalize the sieve by adding a row of
$d$s,

\begin{equation\*}
  \begin{array}{\*{11}{r}}
    d &    d &     d &    d & d &     d &       d &      d &    d & d & \\\\
    c &  c+d &  c+2d & c+3d &   &  c+4d &    c+5d &   c+6d & c+7d &   & \\\\
    c & 2c+d & 3c+3d &      &   & 4c+7d &  5c+12d & 6c+18d &      &   & \\\\
    c & 3c+d &       &      &   & 7c+8d & 12c+20d &        &      &   & \\\\
    c &      &       &      &   & 8c+8d &         &        &      &   &
  \end{array}
\end{equation\*}

However, this unfortunately gives us an inconsistent initial column, since it
contains a \\(d\\) at the top but \\(c\\)s in the remaining entries. So, we take the
liberty of adjusting the initial configuration of the sieve to better suit our
dual sieve, by ridding ourselves of the above inconsistency. Thus, we move the
\\(c\\)s of the initial column into the vertical seed tuple, and at the same time
generalize to a single seed value \\(c\\), while putting the \\(d\\)s into the
horizontal seed tuples, yielding the following sieve,[^fn:2]

\begin{equation\*}
  \begin{array}{r r : \*{5}{r:} r \*{4}{r:} r}
      & &      d &       d &      d &    d & d &
        &      d &       d &      d &    d & d \\\\
    %
      & &        &         &        &      &   &
        &        &         &        &      &   \\\\
    %
    c & &    c+d &    c+2d &   c+3d & c+4d &   &
        &   c+5d &    c+6d &   c+7d & c+8d &   \\\\
    %
    0 & &    c+d &   2c+3d &  3c+6d &      &   &
        & 4c+11d &  5c+17d & 6c+24d &      &   \\\\
    %
    0 & &    c+d &   3c+4d &        &      &   &
        & 7c+15d & 12c+32d &        &      &   \\\\
    %
    0 & &    c+d &         &        &      &   &
        & 8c+16d &         &        &      &   \\\\
    %
    0 & &        &         &        &      &   &
        &        &         &        &      &
  \end{array}
\end{equation\*}

While moving the \\(c\\)s has changed the coefficients of the \\(d\\)s in the sieve,
we now have a more consistent initial configuration, which we believe to be in
the spirit of Long's original theorem, with one constant, \\(c\\), in the vertical
seed tuple and the horizontal seed tuples filled with the constant \\(d\\). As it
turns out, we can perform a further generalization of the initial configuration
by replacing the sequence of \\(d\\)s with a \\(d\\) followed by \\(0\\)s, while putting
it in the vertical seed tuple, as we did with the sequence of \\(1\\)s when we
defined the dual of Moessner's sieve,

\begin{equation\*}
  \begin{array}{r r : \*{6}{r:} r \*{5}{r:} r}
      & &      0 &       0 &      0 &    0 & 0 &
    0 & &      0 &       0 &      0 &    0 & 0 & 0 \\\\
    %
      & &        &         &        &      &   &
      & &        &         &        &      &   &   \\\\
    %
    d & &      d &       d &      d &    d & d &
      & &      d &       d &      d &    d & d &   \\\\
    %
    c & &    c+d &    c+2d &   c+3d & c+4d &   &
      & &   c+5d &    c+6d &   c+7d & c+8d &   &   \\\\
    %
    0 & &    c+d &   2c+3d &  3c+6d &      &   &
      & & 4c+11d &  5c+17d & 6c+24d &      &   &   \\\\
    %
    0 & &    c+d &   3c+4d &        &      &   &
      & & 7c+15d & 12c+32d &        &      &   &   \\\\
    %
    0 & &    c+d &         &        &      &   &
      & & 8c+16d &         &        &      &   &   \\\\
    %
    0 & &        &         &        &      &   &
      & &        &         &        &      &   &
  \end{array}
\end{equation\*}

This results in a minimal initial configuration consisting of a vertical seed
tuple containing a constant \\(d\\) and a constant \\(c\\) followed by \\(0\\)s. We can
now state Long's idealized theorem as follows,

**Theorem 5** (Long's idealized theorem). _Given an initial configuration of two
seed tuples of length \\(k + 2\\),_

\begin{equation\*}
  (0,0,0,\dots,0) \textit{ and } (d,c,0,\dots,0),
\end{equation\*}

_we obtain the sequence of Moessner triangles of rank \\(k\\), where the bottom-most
elements enumerate the sequence,_

\begin{equation}\label{eq:long-result-stream}
  d \cdot {(1 + t)}^{k} + c \cdot {(1 + t)}^{k-1},
\end{equation}

_for values of \\(t \ge 0\\), when applying the dual of Moessner's sieve on the
initial configuration._

As a result of the transformations made above, we now notice that the
coefficients of the \\(c\\)s correspond to the values of Moessner triangles at
rank \\(k\\) while the coefficients of the \\(d\\)s now correspond to the values of
Moessner triangles at rank \\(k - 1\\). This observation suggests that we can view
the above sieve as the composition of two sieves, one creating Moessner
triangles of rank \\(3\\) filled with \\(c\\)s,

\begin{equation\*}
  \begin{array}{\*{14}{r}}
     && 0 &  0 &  0 & 0 & 0 &    &&  0 &   0 &  0 & 0 & 0 \\\\\\\
   c && c &  c &  c & c &   &  c &&  c &   c &  c & c & \\\\
   0 && c & 2c & 3c &   &   & 3c && 4c &  5c & 6c &   & \\\\
   0 && c & 3c &    &   &   & 3c && 7c & 12c &    &   & \\\\
   0 && c &    &    &   &   &  c && 8c &     &    &   & \\\\
   0 &&   &    &    &   &   &  0 &&    &     &    &   &
  \end{array}
\end{equation\*}

and one creating Moessner triangles of rank \\(4\\) filled with \\(d\\)s,

\begin{equation\*}
  \begin{array}{\*{16}{r}}
     & & 0 &  0 &  0 &  0 & 0 & 0 &    &&   0 &   0 &   0 &  0 & 0 & 0 \\\\\\\
   d & & d &  d &  d &  d & d &   &  d &&   d &   d &   d &  d & d & \\\\
   0 & & d & 2d & 1d & 4d &   &   & 4d &&  5d &  6d &  7d & 8d &   & \\\\
   0 & & d & 3d & 6d &    &   &   & 6d && 11d & 17d & 24d &    &   & \\\\
   0 & & d & 4d &    &    &   &   & 4d && 15d & 32d &     &    &   & \\\\
   0 & & d &    &    &    &   &   &  d && 16d &     &     &    &   & \\\\
   0 & &   &    &    &    &   &   &  0 &&     &     &     &    &   &
  \end{array}
\end{equation\*}

This suggests that there is an additional step between Moessner's idealized
theorem and Long's idealized theorem, where we generalize the seed value of \\(1\\)
in Moessner's idealized theorem to a constant, \\(c\\), and obtain Long's weak
theorem,

**Theorem 6** (Long's weak theorem). _Given an initial configuration of two seed
tuples of length \\(k + 2\\),_

\begin{equation\*}
  (0,0,0,\dots,0) \textit{ and } (c,0,0,\dots,0),
\end{equation\*}

_we obtain the sequence of Moessner triangles of rank \\(k\\), where the bottom-most
elements enumerate the sequence,_

\begin{equation\*}
  c \cdot {(1 + t)}^{k},
\end{equation\*}

_for values of \\(t \ge 0\\), when applying the dual of Moessner's sieve on the
initial configuration._

Having defined Long's idealized theorem and Long's weak theorem, we try to look
beyond Long's theorem in the next section.
