content-org/idealized-versions-of-moessners-theorem-and-longs-theorem.org
** 4. Beyond Long's idealized theorem
Since Long's idealized theorem describes the result sequence generated by
Moessner's sieve, when starting from a seed tuple of two constants, $c$ and $d$,

\begin{equation*}
  \begin{array}{r r : *{6}{r:} r *{5}{r:} r }
      & &      0 &       0 &      0 &    0 & 0 &
    0 & &      0 &       0 &      0 &    0 & 0 & 0 \\
    %
      & &        &         &        &      &   &
      & &        &         &        &      &   &   \\
    %
    d & &      d &       d &      d &    d & d &
      & &      d &       d &      d &    d & d &   \\
    %
    c & &    c+d &    c+2d &   c+3d & c+4d &   &
      & &   c+5d &    c+6d &   c+7d & c+8d &   &   \\
    %
    0 & &    c+d &   2c+3d &  3c+6d &      &   &
      & & 4c+11d &  5c+17d & 6c+24d &      &   &   \\
    %
    0 & &    c+d &   3c+4d &        &      &   &
      & & 7c+15d & 12c+32d &        &      &   &   \\
    %
    0 & &    c+d &         &        &      &   &
      & & 8c+16d &         &        &      &   &   \\
    %
    0 & &        &         &        &      &   &
      & &        &         &        &      &   &
  \end{array}
\end{equation*}

we now ask the obvious question of what happens if we start from a seed tuple of
$3$ or even $n$ values? Looking at the result sequence of the above sieve, we
know that it enumerates the values of the binomial, $c \cdot {(1+t)}^3 + d \cdot
{(1+t)}^4$, which gives us the idea to label $c = a_3$ and $d = a_4$, and fill
the rest of the seed tuple with $a_i$,

\begin{equation*}
  \begin{array}{r : r *{5}{r:} r}
        & &                   0 &                  0 &             0 &
                              0 &                  0 &             0 \\\\
    %
    a_4 & &                 a_4 &                a_4 &           a_4 &
                            a_4 &                a_4 &              \\
    %
    a_3 & &             a_3+a_4 &           a_3+2a_4 &      a_3+3a_4 &
                       a_3+4a_4 &                    &               \\
    %
    a_2 & &         a_2+a_3+a_4 &      a_2+2a_3+3a_4 & a_2+3a_3+6a_4 &
                                &                    &              \\
    %
    a_1 & &     a_1+a_2+a_3+a_4 & a_1+2a_2+3a_3+4a_4 &               &
                                &                    &              \\
    %
    a_0 & & a_0+a_1+a_2+a_3+a_4 &                    &               &
                                &                    &               \\
    %
      0 & &                     &                    &               &
                                &                    &
  \end{array}
\end{equation*}

yielding the above Moessner triangle. Now, if we examine the entries of the
hypotenuse in this triangle,

\begin{equation*}
  \begin{array}{*{9}{r}}
        &   &     &   &      &   &      &   &  a_4\\
        &   &     &   &      &   &  a_3 & + & 4a_4\\
        &   &     &   &  a_2 & + & 3a_3 & + & 6a_4\\
        &   & a_1 & + & 2a_2 & + & 3a_3 & + & 4a_4\\
    a_0 & + & a_1 & + &  a_2 & + &  a_3 & + &  a_4
  \end{array}
\end{equation*}

we notice that we can rearrange them into the following Pascal-like triangle,

\begin{equation*}
  \begin{array}{*{9}{c}}
        &     &      &      &  a_0 &      &      &     & \\
        &     &      &  a_1 &      &  a_1 &      &     & \\
        &     &  a_2 &      & 2a_2 &      &  a_2 &     & \\
        & a_3 &      & 3a_3 &      & 3a_3 &      & a_3 & \\
    a_4 &     & 4a_4 &      & 6a_4 &      & 4a_4 &     & a_4
  \end{array}
\end{equation*}

where the sum of the entries yields the following result,

\begin{equation*}
  a_0 + 2a_1 + 4a_2 + 8a_3 + 16a_4,
\end{equation*}

located at the bottom of the first column of the second triangle of the sieve,
which we can restate as,

\begin{equation*}
  2^0 \cdot a_0 + 2^1 \cdot a_1 + 2^2 \cdot a_2 + 2^3 \cdot a_3 + 2^4 \cdot a_4.
\end{equation*}

Likewise, if we calculated the next triangle and the subsequent first column, we
would obtain the values,

\begin{equation*}
  a_0 + 3a_1 + 9a_2 + 27a_3 + 81a_4,
\end{equation*}

which we can once again restate as,

\begin{equation*}
  3^0 \cdot a_0 + 3^1 \cdot a_1 + 3^2 \cdot a_2 + 3^3 \cdot a_3 + 3^4 \cdot a_4.
\end{equation*}

This observation suggests that the application of Moessner's sieve on an initial
configuration with the vertical seed tuple,

\begin{equation*}
  a_4, a_3, a_2, a_1, a_0,
\end{equation*}

yields a sequence of Moessner triangles whose bottom-most elements enumerate the
values of the polynomial,

\begin{equation*}
  p(t) = \sum_{i=0}^4 a_i \cdot {(1 + t)}^i,
\end{equation*}

where $t$ is the triangle index. Thus, we conjecture that applying the dual
sieve on an initial configuration where the vertical seed tuple consists of the
constants,

\begin{equation*}
  a_n, a_{n-1}, \dots, a_1, a_0,
\end{equation*}

yields a sequence of Moessner triangles where the bottom-most elements,
comprising the result sequence, enumerate the values of the polynomial,

\begin{equation*}
  p(t) = \sum_{i=0}^n a_i \cdot {(1 + t)}^i.
\end{equation*}

The reason why the above statement is a conjecture and not a theorem is because
the previous theorems have all been formalized and proved in my [[https://github.com/dragonwasrobot/formal-moessner][Master's thesis]],
while this last statement has not. However, there are strong indications of its
correctness as we can decompose a seed tuple consisting of any sum of two tuples
and have proved that the conjecture holds for the binomial $a_{i+1} \cdot (1 + t)^{i+1} +
a_i \cdot (1 + t)^i$, as stated by Long's idealized theorem.

** 5. Conclusion
In this blog post, we have introduced idealized versions of Moessner's theorem
and Long's theorem -- along with Long's weak theorem -- stated in terms of the
dual of Moessner's sieve. Furthermore, we have conjectured a new generalization
of Long's theorem that connects it to polynomial evaluation.

This post is the final excerpt from my [[https://github.com/dragonwasrobot/formal-moessner][Master's thesis]], in which I formalize and
prove all the statements mentioned in this and the previous posts in the [[https://en.wikipedia.org/wiki/Coq][Coq
proof assistant]].

[fn:1] See "On the Moessner Theorem on Integral Powers" (1966) by Calvin T. Long.

[fn:2] The addition of the dotted vertical lines between each column is for the
  sake of readability.
