content/posts/idealized-versions-of-moessners-theorem-and-longs-theorem.md


## 4. Beyond Long's idealized theorem {#4-dot-beyond-long-s-idealized-theorem}

Since Long's idealized theorem describes the result sequence generated by
Moessner's sieve, when starting from a seed tuple of two constants, \\(c\\) and \\(d\\),

\begin{equation\*}
  \begin{array}{r r : \*{6}{r:} r \*{5}{r:} r }
      & &      0 &       0 &      0 &    0 & 0 &
    0 & &      0 &       0 &      0 &    0 & 0 & 0 \\\\
    %
      & &        &         &        &      &   &
      & &        &         &        &      &   &   \\\\
    %
    d & &      d &       d &      d &    d & d &
      & &      d &       d &      d &    d & d &   \\\\
    %
    c & &    c+d &    c+2d &   c+3d & c+4d &   &
      & &   c+5d &    c+6d &   c+7d & c+8d &   &   \\\\
    %
    0 & &    c+d &   2c+3d &  3c+6d &      &   &
      & & 4c+11d &  5c+17d & 6c+24d &      &   &   \\\\
    %
    0 & &    c+d &   3c+4d &        &      &   &
      & & 7c+15d & 12c+32d &        &      &   &   \\\\
    %
    0 & &    c+d &         &        &      &   &
      & & 8c+16d &         &        &      &   &   \\\\
    %
    0 & &        &         &        &      &   &
      & &        &         &        &      &   &
  \end{array}
\end{equation\*}

we now ask the obvious question of what happens if we start from a seed tuple of
\\(3\\) or even \\(n\\) values? Looking at the result sequence of the above sieve, we
know that it enumerates the values of the binomial, \\(c \cdot {(1+t)}^3 + d \cdot
{(1+t)}^4\\), which gives us the idea to label \\(c = a\_3\\) and \\(d = a\_4\\), and fill
the rest of the seed tuple with \\(a\_i\\),

\begin{equation\*}
  \begin{array}{r : r \*{5}{r:} r}
        & &                   0 &                  0 &             0 &
                              0 &                  0 &             0 \\\\\\\
    %
    a\_4 & &                 a\_4 &                a\_4 &           a\_4 &
                            a\_4 &                a\_4 &              \\\\
    %
    a\_3 & &             a\_3+a\_4 &           a\_3+2a\_4 &      a\_3+3a\_4 &
                       a\_3+4a\_4 &                    &               \\\\
    %
    a\_2 & &         a\_2+a\_3+a\_4 &      a\_2+2a\_3+3a\_4 & a\_2+3a\_3+6a\_4 &
                                &                    &              \\\\
    %
    a\_1 & &     a\_1+a\_2+a\_3+a\_4 & a\_1+2a\_2+3a\_3+4a\_4 &               &
                                &                    &              \\\\
    %
    a\_0 & & a\_0+a\_1+a\_2+a\_3+a\_4 &                    &               &
                                &                    &               \\\\
    %
      0 & &                     &                    &               &
                                &                    &
  \end{array}
\end{equation\*}

yielding the above Moessner triangle. Now, if we examine the entries of the
hypotenuse in this triangle,

\begin{equation\*}
  \begin{array}{\*{9}{r}}
        &   &     &   &      &   &      &   &  a\_4\\\\
        &   &     &   &      &   &  a\_3 & + & 4a\_4\\\\
        &   &     &   &  a\_2 & + & 3a\_3 & + & 6a\_4\\\\
        &   & a\_1 & + & 2a\_2 & + & 3a\_3 & + & 4a\_4\\\\
    a\_0 & + & a\_1 & + &  a\_2 & + &  a\_3 & + &  a\_4
  \end{array}
\end{equation\*}

we notice that we can rearrange them into the following Pascal-like triangle,

\begin{equation\*}
  \begin{array}{\*{9}{c}}
        &     &      &      &  a\_0 &      &      &     & \\\\
        &     &      &  a\_1 &      &  a\_1 &      &     & \\\\
        &     &  a\_2 &      & 2a\_2 &      &  a\_2 &     & \\\\
        & a\_3 &      & 3a\_3 &      & 3a\_3 &      & a\_3 & \\\\
    a\_4 &     & 4a\_4 &      & 6a\_4 &      & 4a\_4 &     & a\_4
  \end{array}
\end{equation\*}

where the sum of the entries yields the following result,

\begin{equation\*}
  a\_0 + 2a\_1 + 4a\_2 + 8a\_3 + 16a\_4,
\end{equation\*}

located at the bottom of the first column of the second triangle of the sieve,
which we can restate as,

\begin{equation\*}
  2^0 \cdot a\_0 + 2^1 \cdot a\_1 + 2^2 \cdot a\_2 + 2^3 \cdot a\_3 + 2^4 \cdot a\_4.
\end{equation\*}

Likewise, if we calculated the next triangle and the subsequent first column, we
would obtain the values,

\begin{equation\*}
  a\_0 + 3a\_1 + 9a\_2 + 27a\_3 + 81a\_4,
\end{equation\*}

which we can once again restate as,

\begin{equation\*}
  3^0 \cdot a\_0 + 3^1 \cdot a\_1 + 3^2 \cdot a\_2 + 3^3 \cdot a\_3 + 3^4 \cdot a\_4.
\end{equation\*}

This observation suggests that the application of Moessner's sieve on an initial
configuration with the vertical seed tuple,

\begin{equation\*}
  a\_4, a\_3, a\_2, a\_1, a\_0,
\end{equation\*}

yields a sequence of Moessner triangles whose bottom-most elements enumerate the
values of the polynomial,

\begin{equation\*}
  p(t) = \sum\_{i=0}^4 a\_i \cdot {(1 + t)}^i,
\end{equation\*}

where \\(t\\) is the triangle index. Thus, we conjecture that applying the dual
sieve on an initial configuration where the vertical seed tuple consists of the
constants,

\begin{equation\*}
  a\_n, a\_{n-1}, \dots, a\_1, a\_0,
\end{equation\*}

yields a sequence of Moessner triangles where the bottom-most elements,
comprising the result sequence, enumerate the values of the polynomial,

\begin{equation\*}
  p(t) = \sum\_{i=0}^n a\_i \cdot {(1 + t)}^i.
\end{equation\*}

The reason why the above statement is a conjecture and not a theorem is because
the previous theorems have all been formalized and proved in my [Master's thesis](https://github.com/dragonwasrobot/formal-moessner),
while this last statement has not. However, there are strong indications of its
correctness as we can decompose a seed tuple consisting of any sum of two tuples
and have proved that the conjecture holds for the binomial \\(a\_{i+1} \cdot (1 + t)^{i+1} +
a\_i \cdot (1 + t)^i\\), as stated by Long's idealized theorem.


## 5. Conclusion {#5-dot-conclusion}

In this blog post, we have introduced idealized versions of Moessner's theorem
and Long's theorem -- along with Long's weak theorem -- stated in terms of the
dual of Moessner's sieve. Furthermore, we have conjectured a new generalization
of Long's theorem that connects it to polynomial evaluation.

This post is the final excerpt from my [Master's thesis](https://github.com/dragonwasrobot/formal-moessner), in which I formalize and
prove all the statements mentioned in this and the previous posts in the [Coq
proof assistant](https://en.wikipedia.org/wiki/Coq).

[^fn:1]: See "On the Moessner Theorem on Integral Powers" (1966) by Calvin T. Long.
[^fn:2]: The addition of the dotted vertical lines between each column is for the
    sake of readability.
